/* original app has been modified and moved */
"%1$@ has been updated and moved. Do you want to change all your keychain items to allow the new version access to your keychain?" = "A aplicação (%1$@) foi actualizada ou deslocada. Gostaria de alterar todos os elementos do porta-chaves para permitir o acesso da nova versão?";

/* original app has been updated (paths equal) v2 */
"%1$@ has been updated. Do you want to allow the new version to access the same keychain items (such as passwords) as the previous version?" = "A aplicação (%1$@) foi actualizada. Gostaria de permitir que a nova versão aceda aos mesmos elementos do porta-chaves (palavra-passes, por exemplo) que a versão anterior?";

/* original app has been updated (paths equal) */
"%1$@ has been updated. Do you want to change all your keychain items to allow the new version access to your keychain?" = "A aplicação (%1$@) foi actualizada. Gostaria de alterar todos os elementos do porta-chaves para permitir o acesso da nova versão?";

/* Descriptive text for when the app doesn't match the item's ACL. */
"%1$@ may have been updated or changed, perhaps during a software update. Because of this you need to allow permission to use the keychain item." = "É possível que a aplicação (%1$@) tenha sido actualizada ou alterada, provavelmente durante uma actualização de software. Necessita, por isso, de dar permissão de utilização do elemento do porta‑chaves.";

/* Descriptive text for when the app doesn't match the item acls in a keychain's items. */
"%1$@ may have been updated or changed, perhaps during a software update. Because of this you need to allow permission to use the keychain." = "É possível que a aplicação (%1$@) tenha sido actualizada ou alterada, provavelmente durante uma actualização de software. Necessita, por isso, de dar permissão de utilização do porta‑chaves.";

/* Confirm Access message text when operation is unknown. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key affected. */
"%1$@ wants to access key \\U201C%2$@\\U201D in your keychain." = "%1$@ pretende aceder à chave “%2$@” no porta-chaves.";

/* Confirm Access message text when attempting to generate a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being generated. */
"%1$@ wants to add the  \\U201C%2$@\\U201D item to your keychain." = "%1$@ pretende adicionar o elemento “%2$@” ao porta-chaves.";

/* Confirm Access message text when attempting to modify the ACL of a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key of which the ACL is being changed. */
"%1$@ wants to change access permissions of the \\U201C%2$@\\U201D item in your keychain." = "%1$@ pretende alterar as permissões de acesso do elemento “%2$@” no porta-chaves.";

/* Confirm Access message text when attempting to modify the owner of a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key of which the owner is being changed. */
"%1$@ wants to change the owner of the \\U201C%2$@\\U201D item in your keychain (the owner of the item is the one allowed to change access permissions)." = "%1$@ pretende alterar o proprietário do elemento “%2$@” no porta-chaves (o proprietário é o utilizador que pode alterar as permissões de acesso).";

/* Confirm Access message text when attempting to decrypt using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to decrypt the \\U201C%2$@\\U201D item in your keychain." = "%1$@ pretende decifrar o elemento “%2$@” no porta-chaves.";

/* Confirm Access message text when attempting to delete a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being being deleted. */
"%1$@ wants to delete the \\U201C%2$@\\U201D item from your keychain." = "%1$@ pretende apagar o elemento “%2$@” do porta-chaves.";

/* Confirm Access message text when attempting to derive a key from a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used to derive a key from. */
"%1$@ wants to derive a key from key \\U201C%2$@\\U201D in your keychain." = "%1$@ pretende obter uma chave a partir da chave “%2$@” no porta-chaves.";

/* Confirm Access message text when attempting to encrypt using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to encrypt using key \\U201C%2$@\\U201D in your keychain." = "%1$@ pretende codificar utilizando a chave “%2$@” no porta-chaves.";

/* Confirm Access message text when attempting to export a key in wrapped form. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being exported. */
"%1$@ wants to export key \\U201C%2$@\\U201D from your keychain." = "%1$@ pretende exportar a chave “%2$@” do porta-chaves.";

/* Confirm Access message text when attempting to import a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being imported. */
"%1$@ wants to import key \\U201C%2$@\\U201D into your keychain." = "%1$@ pretende importar a chave “%2$@” para o porta-chaves.";

/* Confirm Access message text when attempting to sign using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to sign using key \\U201C%2$@\\U201D in your keychain." = "%1$@ pretende assinar utilizando a chave “%2$@” no porta-chaves.";

/* Confirm Access message text when attempting to sign using a key. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to sign with key \\U201C%2$@\\U201D in your keychain." = "%1$@ pretende assinar com a chave “%2$@” no porta-chaves.";

/* Unlock reason */
"%1$@ wants to use the \\U201C%2$@\\U201D keychain." = "%1$@ pretende utilizar o porta-chaves “%2$@”.";

/* Confirm Access message text when attempting to decrypt using a groupkey. %1$@ is replaced by the name of the application making the request. %2$@ says '...allow?' or '...enter keychain password' if password is required for the operation. */
"%1$@ wants to use your .Mac password. %2$@" = "%1$@ pretende utilizar a palavra-passe .Mac para aceder a %2$@";

/* Confirm Access message text when attempting to decrypt using a groupkey. %1$@ is replaced by the name of the application making the request, %2$@ is replaced by the label of the key being used. */
"%1$@ wants to use your confidential information stored in \\U201C%2$@\\U201D in your keychain." = "%1$@ pretende utilizar informações pessoais confidenciais armazenadas em “%2$@” no porta-chaves.";

/* Part of the Confirm Access message text when application fails static code-signing verification.  %1$@ is replaced by the name of the application making the request. */
"\\U201C%1$@\\U201D has been altered on disk. You might be running something that is pretending to be \\U201C%1$@\\U201D." = "“%1$@” foi alterado no disco. É possível que esteja a executar algo que se esteja a fazer passar por “%1$@”.";

/* Part of the Confirm Access message text when application has failed dynamic code-signing verification.  %1$@ is replaced by the name of the application making the request. */
"\\U201C%1$@\\U201D has been modified while running and no longer conforms to what was installed on disk." = "“%1$@” foi modificado durante a execução e já não está conforme com o que foi instalado no disco.";

/* Part of the Confirm Access message text when neither a signature nor a path is available to verify the application. */
"\\U201C%1$@\\U201D is unknown. Access is denied." = "“%1$@” é desconhecido. O acesso foi recusado.";

/* new app introduced, give it access? */
"An application named %1$@ needs to access your keychain, but there is an existing version. Do you want to change all your keychain items to allow the new version access to your keychain?" = "Uma aplicação designada %1$@ necessita de aceder ao porta-chaves, mas existe já uma versão com o mesmo nome. Gostaria de alterar todos os elementos para permitir o acesso da nova versão?";

/* AppType */
"Application:" = "Aplicação:";

/* Authentication no longer needed */
"Authentication is no longer needed." = "Não é necessário efectuar a autenticação.";

/* Cancel button title */
"Cancel" = "Cancelar";

/* changed application wanting access */
"Changed Process:" = "Alteração:";

/* confirm that a application changed panel title string */
"Confirm Application Change" = "Confirmar alteração da aplicação";

/* Copy Location To Clipboard SFURLView menu item */
"Copy Location To Clipboard" = "Copiar localização para o Clipboard";

/* Detail disclosure button label.  Details about authorization requests. */
"Detail" = "Detalhe";

/* Do you want to allow access to this item? */
"Do you want to allow access to this item?" = "Gostaria de permitir o acesso a este elemento?";

/* Do you want to allow this? */
"Do you want to allow this?" = "Gostaria de permitir?";

/* Password for a newly created keychain, change keychain password. */
"Enter a new password for the keychain \\U201C%1$@.\\U201D" = "Digite uma nova palavra-passe para o porta-chaves “%1$@”.";

/* When configuring a keychain on additional Macs (non-login kc) */
"Enter the password for keychain \\U201C%1$@\\U201D on \\U201C%2$@\\U201D." = "Digite a palavra-passe para o porta-chaves “%1$@” em “%2$@”.";

/* Enter the password for keychain \\U201C%1$@\\U201D on one of the computers you have synchronized. */
"Enter the password for keychain \\U201C%1$@\\U201D on one of the computers you have synchronized." = "Digite a palavra-passe do porta-chaves “%1$@” num dos computadores que sincronizou.";

/* Part of the Confirm Access message text when application signature cannot be verified.  %1$@ is replaced by the name of the application making the request. */
"It is not possible to tell whether \\U201C%1$@\\U201D is unchanged from the last time it was used. Someone could have modified or replaced it." = "Não é possível determinar se “%1$@” se mantém inalterado desde a última vez que foi utilizado. Pode ter sido modificado ou substituído.";

/* Keychain Access application's name */
"Keychain Access.app" = "Acesso ao Porta-chaves.app";

/* When referring to a faceless application or tool that represents the system, Mac OS X, your computer, your system, this replaces the client name in the authentication dialog */
"Mac OS X" = "Mac OS X";

/* Shown instead of Password: when asking the user to provide a new password or change an old one. */
"New Password:" = "Nova palavra-passe:";

/* No button title */
"No" = "Não";

/* Sometimes no password is required and the field is inactive.  This string is set in it as a placeholder. */
"Not required." = "Não necessário.";

/* OK button title */
"OK" = "OK";

/* Show user provided hint to help remember password */
"Password hint: \\U201C%1$@\\U201D." = "Dica da palavra-passe: “%1$@”.";

/* In the case of a smartcard instead of a keychain, the PIN label is substituted where the Password label is. */
"PIN:" = "PIN:";

/* Unlock reason detail */
"Please enter the keychain password." = "Digite a palavra-passe do porta-chaves.";

/* Typical pwd suggestion */
"Secure passwords typically are longer than 6 characters and should not contain obvious words like dog, cat, and so on." = "As palavras-passe seguras devem incluir mais de 6 caracteres e não devem referir palavras óbvias, cão, gato, etc.";

/* Authentication unable to continue */
"Sorry, unable to continue the authentication." = "Impossível continuar a autenticação.";

/* Unlock unable to continue */
"Sorry, unable to continue the unlock." = "Impossível continuar a desprotecção.";

/* Authentication canceled */
"Sorry, you attempted to authenticate too many times." = "Demasiadas tentativas de autenticação.";

/* NewPwd canceled */
"Sorry, you attempted to set your password for the \\U201C%1$@\\U201D keychain too many times." = "Tentou definir demasiadas vezes a palavra-passe para o porta-chaves “%1$@”.";

/* Unlock canceled */
"Sorry, you attempted to unlock \\U201C%1$@\\U201D too many times." = "Tentou desproteger a chave “%1$@” demasiadas vezes.";

/* Unlock failed; invalid password */
"Sorry, you entered an invalid password." = "Palavra-passe inválida.";

/* For referring to the system keychain. */
"System" = "Sistema";

/* Application with same name is different and possibly in a different location as well. */
"The \\U201C%1$@\\U201D software on your computer has changed and wants to access your keychain." = "O software “%1$@” no seu computador foi alterado e pretende aceder ao porta-chaves.";

/* Part of the Confirm Access informational text when application is unsigned.  %1$@ is replaced by the name of the application making the request. */
"The authenticity of \\U201C%1$@\\U201D cannot be verified." = "Impossível verificar a autenticidade de “%1$@”.";

/* error after succefully entering a password which then fails to get added to a keychain. */
"The item could not be added to your default keychain." = "Não foi possível adicionar elemento ao porta-chaves predefinido.";

/* detailed message for allowing a process to have the same access as original app v2. */
"The keychain items may include passwords and other important information. If you click Allow, the new version of \\U201C%1$@\\U201D will have access to all the keychain items used by previous version. This change is permanent." = "Os elementos do porta-chaves podem ser palavras-passe ou outra informação importante. Se clicar em Permitir, a nova versão de “%1$@” terá acesso a todos os elementos do porta-chave usados pela versão anterior. Esta alteração é permanente.";

/* Authentication failed; invalid username or password */
"The name or password you entered is incorrect." = "A palavra-passe ou nome foram introduzidos incorrectamente.";

/* detailed message for allowing a process to have the same access as original app. */
"This change is permanent and affects all keychain items in all your keychains." = "Esta alteração é permanente e afecta todos os elementos em todos os portas-chaves.";

/* Application with same name is different and possibly in a different location as well. */
"This is a new version of the application \\U201C%1$@\\U201D. Do you want to allow it to access the same keychain items as the previous version?" = "Trata-se de uma nova versão da aplicação “%1$@”. Pretende permitir o acesso desta versão aos mesmos elementos do porta-chaves aos quais a versão anterior tinha acesso?";

/* When configuring a keychain on additional Macs - details text */
"This is the same password you used to first synchronize your keychain \\U201C%@\\U201D with .Mac." = "Utilizou já esta palavra-passe quando sincronizou pela primeira vez o porta-chaves “%@” com a conta .Mac.";

/* Please enter the keychain password. */
"To allow this, enter the \\U201C%1$@\\U201D keychain password." = "Para permitir isto, digite a palavra-passe do porta-chaves “%1$@”.";

/* When configuring a keychain on additional Macs (login kc) */
"To synchronize your keychain on this computer, enter the password for your user account on \\U201C%1$@\\U201D." = "Para sincronizar o porta-chaves deste computador, digite a palavra-passe da sua conta de utilizador em “%1$@”.";

/* To synchronize your keychain on this computer, enter your user account password for any of the computers you synchronize. */
"To synchronize your keychain on this computer, enter your user account password for any of the computers you synchronize." = "Para sincronizar o porta-chaves deste computador, digite a palavra-passe da sua conta de utilizador em todos os computadores que pretender sincronizar.";

/* ToolType */
"Tool:" = "Ferramenta:";

/* Try again later */
"Try again later." = "Tente de novo mais tarde.";

/* Please Try again */
"Try entering your information again." = "Tente voltar a introduzir a informação.";

/* Authenticate greeting changing the system certificate Trust Settings. */
"Type an administrator's name and password to make changes to the System Certificate Trust Settings." = "Digite um nome e palavra-passe de administrador, para alterar as definições de segurança do certificado do sistema.";

/* Authenticate greeting for a non-admin asking to authenticate as an admin.  %1$@ gets replaced with Application name, or the localized string representing the system (Mac OS X). */
"Type an administrator\\U2019s name and password to allow %1$@ to make changes." = "Digite um nome e palavra-passe de administrador, para permitir a %1$@ efectuar alterações.";

/* Authenticate greeting for any group.  %1$@ gets replaced with group name and %2$@ gets replaced with the calling Application's name, or the localized string representing the system (Mac OS X). */
"Type the name and password of a user in the \\U201C%1$@\\U201D group to allow %2$@ to make changes." = "Digite o nome e palavra-passe de um utilizador no grupo “%1$@”, para permitir a %2$@ efectuar alterações.";

/* Authenticate greeting for an admin, or a user that can authorize.  %1$@ gets replaced with Application name, or the localized string representing the system (Mac OS X). */
"Type your password to allow %1$@ to make changes." = "Digite a palavra-passe para %1$@ poder efectuar alterações.";

/* Authenticate greeting changing the per-user certificate Trust Settings. */
"Type your password to make changes to your Certificate Trust Settings." = "Digite o seu nome e palavra-passe, para alterar as definições de segurança do certificado.";

/* UnkownProcessType */
"Unknown:" = "Desconhecido:";

/* Unlock no longer needed */
"Unlock is no longer needed." = "A desprotecção não é necessária.";

/* Yes button title */
"Yes" = "Sim";

/* pwd is blank */
"You have not provided a password. Please specify one." = "É necessário especificar uma palavra-passe, mas nenhuma foi indicada.";

/* pwd too simple */
"You have specified a non-secure password. Please use a longer one." = "A palavra-passe especificada não é segura. Use uma palavra-passe maior.";

/* used that pwd before */
"You have used that password before. Please use a different one." = "A palavra-passe especificada já foi utilizada anteriormente. Use uma palavra-passe diferente.";

/* Authentication failure for admin group.  %1$@ gets replaced with Application name. */
"You must type an administrator\\U2019s name and password to make changes to %1$@." = "Necessita digitar um nome e palavra-passe de um administrador para efectuar alterações a %1$@.";

/* Authentication failure for any group.  %1$@ gets replaced with group name and %2$@ gets replaced with the calling Application's name. */
"You must type the name and password of a user in the \\U201C%1$@\\U201D group to make changes to %2$@." = "Necessita digitar um nome e palavra-passe do utilizador no grupo “%1$@” para alterar %2$@.";

/* NewPwd verify not equal */
"Your password is not the same as the verify password." = "A palavra-passe não é igual à palavra-passe de verificação.";

/* pwd unacceptable */
"Your password is unacceptable." = "A palavra-passe não é aceitável.";

